In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame({'key':['a','b','c','d','e'],
                    'A1': range(5),
                    'B1':range(5,10)})

df2 = pd.DataFrame({'key':['a','b','c'],
                    'A':range(3),
                    'B':range(3,6)})

In [5]:
df1.info()
df1.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   key     5 non-null      object
 1   A1      5 non-null      int64
 2   B1      5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

             A1        B1
count  5.000000  5.000000
mean   2.000000  7.000000
std    1.581139  1.581139
min    0.000000  5.000000
25%    1.000000  6.000000
50%    2.000000  7.000000
75%    3.000000  8.000000
max    4.000000  9.000000

In [6]:
df2
df2.describe()

         A    B
count  3.0  3.0
mean   1.0  4.0
std    1.0  1.0
min    0.0  3.0
25%    0.5  3.5
50%    1.0  4.0
75%    1.5  4.5
max    2.0  5.0

In [8]:
pd.merge(df1,df2, how = 'inner',on = 'key')

  key  A1  B1  A  B
0   a   0   5  0  3
1   b   1   6  1  4
2   c   2   7  2  5

In [10]:
pd.merge(df1,df2,how = 'outer',on = 'key') # sql full join

  key  A1  B1    A    B
0   a   0   5  0.0  3.0
1   b   1   6  1.0  4.0
2   c   2   7  2.0  5.0
3   d   3   8  NaN  NaN
4   e   4   9  NaN  NaN

In [11]:
pd.merge(df1,df2,how = 'left',on = 'key')[['A1','A']]

   A1    A
0   0  0.0
1   1  1.0
2   2  2.0
3   3  NaN
4   4  NaN

In [12]:
pd.merge(df1,df2,how = 'right',on = 'key')

  key  A1  B1  A  B
0   a   0   5  0  3
1   b   1   6  1  4
2   c   2   7  2  5

In [28]:
left = pd.DataFrame({'key1': ['a', 'a', 'b', 'c'],
                     'key2': ['a', 'b', 'a', 'b'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['a', 'b', 'b', 'c'],
                      'key2': ['a', 'b', 'a', 'a'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

In [29]:
left

  key1 key2   A   B
0    a    a  A0  B0
1    a    b  A1  B1
2    b    a  A2  B2
3    c    b  A3  B3

In [30]:
right

  key1 key2   C   D
0    a    a  C0  D0
1    b    b  C1  D1
2    b    a  C2  D2
3    c    a  C3  D3

In [31]:
pd.merge(left,right, how = 'inner',on = ['key1','key2'])

  key1 key2   A   B   C   D
0    a    a  A0  B0  C0  D0
1    b    a  A2  B2  C2  D2

In [35]:
pd.merge(left,right,how = 'outer',on = ['key1','key2'])

  key1 key2    A    B    C    D
0    a    a   A0   B0   C0   D0
1    a    b   A1   B1  NaN  NaN
2    b    a   A2   B2   C2   D2
3    c    b   A3   B3  NaN  NaN
4    b    b  NaN  NaN   C1   D1
5    c    a  NaN  NaN   C3   D3

In [36]:
pd.merge(left,right,how = 'left',on = ['key1','key2'])

  key1 key2   A   B    C    D
0    a    a  A0  B0   C0   D0
1    a    b  A1  B1  NaN  NaN
2    b    a  A2  B2   C2   D2
3    c    b  A3  B3  NaN  NaN

In [37]:
pd.merge(left,right,how = 'right',on = ['key1','key2'])

  key1 key2    A    B   C   D
0    a    a   A0   B0  C0  D0
1    b    b  NaN  NaN  C1  D1
2    b    a   A2   B2  C2  D2
3    c    a  NaN  NaN  C3  D3

In [38]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [39]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4,5,6,7])

In [40]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [41]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [43]:
pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [ ]:
pd

In [2]:
import pandas as pd
import numpy as np

In [3]:
data_dic = {'A':[1,2,np.nan,4,np.nan],
            'B':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'C':[11,12,13,14,15],
            'D':[16,np.nan,18,19,20]}
df = pd.DataFrame(data_dic) 
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [4]:
df.isnull()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [5]:
df.isnull().sum()

A    2
B    5
C    0
D    1
dtype: int64

In [6]:
df['A'].isnull()

0    False
1    False
2     True
3    False
4     True
Name: A, dtype: bool

In [7]:
df['A'].isnull().sum()

2

In [8]:
df.isna()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [9]:
df.isna().sum()

A    2
B    5
C    0
D    1
dtype: int64

In [10]:
df.isna().sum().sum()

8

In [13]:
df.loc[1].isnull().sum()

2

In [14]:
df.notnull()

       A      B     C      D
0   True  False  True   True
1   True  False  True  False
2  False  False  True   True
3   True  False  True   True
4  False  False  True   True

In [15]:
df.shape

(5, 4)

In [16]:
df.notnull().sum()

A    3
B    0
C    5
D    4
dtype: int64

In [17]:
df.notnull().sum().sum()

12

In [18]:
df['A'].sum()

7.0

In [19]:
df['A'].mean()

2.3333333333333335

In [20]:
df.dropna(axis=0)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [21]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [29]:
df.dropna(thresh=2, axis=0)

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [25]:
df.dropna(axis=1)

    C
0  11
1  12
2  13
3  14
4  15

In [26]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [30]:
df.fillna(value=2)

     A    B   C     D
0  1.0  2.0  11  16.0
1  2.0  2.0  12   2.0
2  2.0  2.0  13  18.0
3  4.0  2.0  14  19.0
4  2.0  2.0  15  20.0

In [31]:
df['A'].fillna(value = df['A'].mean())

0    1.000000
1    2.000000
2    2.333333
3    4.000000
4    2.333333
Name: A, dtype: float64

In [32]:
df.fillna(method='ffill')

C:\Users\Hp\AppData\Local\Temp\ipykernel_6476\3524271710.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  16.0
2  2.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  4.0 NaN  15  20.0

In [33]:
df.fillna(method='bfill')

C:\Users\Hp\AppData\Local\Temp\ipykernel_6476\2831856154.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  18.0
2  4.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [34]:
df.fillna(0)

     A    B   C     D
0  1.0  0.0  11  16.0
1  2.0  0.0  12   0.0
2  0.0  0.0  13  18.0
3  4.0  0.0  14  19.0
4  0.0  0.0  15  20.0

In [1]:
import pandas as pd

In [2]:
data = {'Store':['Walmart','Walmart','Costco','Costco','Target','Target'],
       'Customer':['Tim','Jermy','Mark','Denice','Ray','Sam'],
       'Sales':[150,200,550,90,430,120]}
df = pd.DataFrame(data)
df

     Store Customer  Sales
0  Walmart      Tim    150
1  Walmart    Jermy    200
2   Costco     Mark    550
3   Costco   Denice     90
4   Target      Ray    430
5   Target      Sam    120

In [3]:
df.groupby("Store").sum()

           Customer  Sales
Store
Costco   MarkDenice    640
Target       RaySam    550
Walmart    TimJermy    350

In [4]:
df.groupby("Store").count()[['Customer']]

         Customer
Store
Costco          2
Target          2
Walmart         2

In [28]:
sum1 = by_store.sum()
mean1 = by_store.mean()

TypeError: agg function failed [how->mean,dtype->object]

In [29]:
sum1

           Customer  Sales
Store
Costco   MarkDenice    640
Target       RaySam    550
Walmart    TimJermy    350

In [30]:
mean1

NameError: name 'mean1' is not defined

In [31]:
sum1['mean'] = mean1['Sales']

sum1

NameError: name 'mean1' is not defined

In [34]:
df.groupby(('Store')).mean()

TypeError: agg function failed [how->mean,dtype->object]